/*
练习 10-2
编写如下函数，将*y年*m月*d日的日期，修改为其前一天或后一天的曰期。
void decrement_date(int *y,int *m,int *d)
void increment_date(int *y,int *m,int *d)
注意计算时要考虑到闰年的问题。
*/
#include<stdio.h>
#include<stdlib.h>

void decrement_date(int *y,int *m,int *d);
void increment_date(int *y,int *m,int *d);

void decrement_date(int *y,int *m,int *d){
    //判断是不是世纪年
    if(*y % 100 == 0){
        //世纪年是不是闰年
        if(*y % 400 == 0){
            // 是不是2月
            if(*m == 2){
                if(*d > 28){
                    puts("你输入输入了错误的日期");
                    exit(0);
                }
            }
            // 是不是每个月1号
            if (*d == 1){
                // 日期的变化
                if(*m == 1 ||*m == 2 || *m == 4 || *m == 6 || *m == 8 || *m == 9 || *m == 12){
                    *d = 31;
                }
                if(*m == 5 || *m == 7 || *m == 10 || *m == 11){
                    *d = 30;
                }
                if(*m == 3){
                    *d = 28;
                }
                //如果是1月1日年份的变化
                if(*m == 1){
                    *y -= 1;
                }
                // 如果是1号的话月份的变化
                if(*m >= 2 && *m <= 12){
                    *m -= 1;
                }else{
                    *m = 12;
                }
            }else{
                *d -= 1;
            }

        }else{
            //世纪年不是闰年
            // 是不是2月
            if(*m == 2){
                if(*d > 27){
                    puts("你输入输入了错误的日期");
                    exit(0);
                }
            }
            // 是不是每个月1号
            if (*d == 1){
                // 日期的变化
                if(*m == 1 || *m == 2 || *m == 4 || *m == 6 || *m == 8 || *m == 9 || *m == 12){
                    *d = 31;
                }
                if(*m == 5 || *m == 7 || *m == 10 || *m == 11){
                    *d = 30;
                }
                if(*m == 3){
                    *d = 27;
                }
                //如果是1月1日年份的变化
                if(*m == 1){
                    *y -= 1;
                }
                // 如果是1号的话月份的变化
                if(*m >= 2 && *m <= 12){
                    *m -= 1;
                }else{
                    *m = 12;
                }
            }else{
                *d -= 1;
            }

        }
    }else{
        //不是世纪年
        //是不是闰年
        if(*y % 4 == 0 || *y % 100 != 0){
            // 是不是2月
            if(*m == 2){
                if(*d > 28){
                    puts("你输入输入了错误的日期");
                    exit(0);
                }
            }
            // 是不是每个月1号
            if (*d == 1){
                // 日期的变化
                if(*m == 1 || *m == 2 || *m == 4 || *m == 6 || *m == 8 || *m == 9 || *m == 12){
                    *d = 31;
                }
                if(*m == 5 || *m == 7 || *m == 10 || *m == 11){
                    *d = 30;
                }
                if(*m == 3){
                    *d = 28;
                }
                //如果是1月1日年份的变化
                if(*m == 1){
                    *y -= 1;
                }
                // 如果是1号的话月份的变化
                if(*m >= 2 && *m <= 12){
                    *m -= 1;
                }else{
                    *m = 12;
                }
            }else{
                *d -= 1;
            }
        }else{
            // 是不是2月
            if(*m == 2){
                if(*d > 28){
                    puts("你输入输入了错误的日期");
                    exit(0);
                }
            }
            // 是不是每个月1号
            if (*d == 1){
                // 日期的变化
                if(*m == 1 || *m == 2 || *m == 4 || *m == 6 || *m == 8 || *m == 9 || *m == 12){
                    *d = 31;
                }
                if(*m == 5 || *m == 7 || *m == 10 || *m == 11){
                    *d = 30;
                }
                if(*m == 3){
                    *d = 28;
                }
                //如果是1月1日年份的变化
                if(*m == 1){
                    *y -= 1;
                }
                // 如果是1号的话月份的变化
                if(*m >= 2 && *m <= 12){
                    *m -= 1;
                }else{
                    *m = 12;
                }
            }else{
                *d -= 1;
            }
        }


    }
printf("前一天是%d 年 %d 月 %d 日\n", *y, *m, *d);
}

void increment_date(int *y,int *m,int *d){
    //判断是不是世纪年
    if(*y % 100 == 0){
        //世纪年是不是闰年
        if(*y % 400 == 0){
            // 是不是2月
            if(*m == 2){
                if(*d > 28){
                    puts("你输入输入了错误的日期");
                    exit(0);
                }else if(*d == 28){
                    *d = 1;
                    *m = 3;
                }else{
                    *d += 1;
                }
            }
            // 是不是每个月30号
            if (*d == 30){
                // 日期的变化
                if(*m == 4 ||*m == 6 || *m == 9 || *m == 11){
                    *d = 1;
                    *m += 1;
                    
                }    
            }
            // 是不是每个月31号
            if (*d == 31){
                // 日期的变化
                if(*m == 1 ||*m == 3 || *m == 5 || *m == 7 || *m == 8 || *m == 10 || *m == 12){
                    *d = 1;
                    if(*m < 12){
                        *m += 1;
                    }else{
                        *m = 12;
                    }
                }    
            }

        }else{
            //世纪年不是闰年
            // 是不是2月
            if(*m == 2){
                if(*d > 27){
                    puts("你输入输入了错误的日期");
                    exit(0);
                }
            }
            // 是不是每个月1号
            if (*d == 1){
                // 日期的变化
                if(*m == 1 || *m == 2 || *m == 4 || *m == 6 || *m == 8 || *m == 9 || *m == 12){
                    *d = 31;
                }
                if(*m == 5 || *m == 7 || *m == 10 || *m == 11){
                    *d = 30;
                }
                if(*m == 3){
                    *d = 27;
                }
                //如果是1月1日年份的变化
                if(*m == 1){
                    *y -= 1;
                }
                // 如果是1号的话月份的变化
                if(*m >= 2 && *m <= 12){
                    *m -= 1;
                }else{
                    *m = 12;
                }
            }else{
                *d -= 1;
            }

        }
    }else{
        //不是世纪年
        //是不是闰年
        if(*y % 4 == 0 || *y % 100 != 0){
            // 是不是2月
            if(*m == 2){
                if(*d > 28){
                    puts("你输入输入了错误的日期");
                    exit(0);
                }
            }
            // 是不是每个月31号
            if (*d == 31){
                // 日期的变化
                if(*m == 1 || *m == 2 || *m == 4 || *m == 6 || *m == 8 || *m == 9 || *m == 12){
                    *d = 31;
                }
                if(*m == 5 || *m == 7 || *m == 10 || *m == 11){
                    *d = 30;
                }
                if(*m == 3){
                    *d = 28;
                }
                //如果是1月1日年份的变化
                if(*m == 1){
                    *y -= 1;
                }
                // 如果是1号的话月份的变化
                if(*m >= 2 && *m <= 12){
                    *m -= 1;
                }else{
                    *m = 12;
                }
            }else{
                *d -= 1;
            }
        }else{
            // 是不是2月
            if(*m == 2){
                if(*d > 28){
                    puts("你输入输入了错误的日期");
                    exit(0);
                }
            }
            // 是不是每个月1号
            if (*d == 1){
                // 日期的变化
                if(*m == 1 || *m == 2 || *m == 4 || *m == 6 || *m == 8 || *m == 9 || *m == 12){
                    *d = 31;
                }
                if(*m == 5 || *m == 7 || *m == 10 || *m == 11){
                    *d = 30;
                }
                if(*m == 3){
                    *d = 28;
                }
                //如果是1月1日年份的变化
                if(*m == 1){
                    *y -= 1;
                }
                // 如果是1号的话月份的变化
                if(*m >= 2 && *m <= 12){
                    *m -= 1;
                }else{
                    *m = 12;
                }
            }else{
                *d -= 1;
            }
        }


    }
printf("后一天是%d 年 %d 月 %d 日\n", *y, *m, *d);


}

int main(){
    int y, m, d;
    
    puts("请分别输入年，月，日");
    printf("请输入年 ");    scanf("%d",&y);
    printf("请输入月 ");    scanf("%d",&m);
    printf("请输入日 ");    scanf("%d",&d);

    decrement_date(&y, &m, &d);
    putchar('\n');
    increment_date(&y, &m, &d);
    putchar('\n');

    return 0;
}